const c_data = [
  {
    id: 1,
    ja: `<h3>★連絡</h3>
　案件依頼、お問い合わせ等は、<br>
　　ディスコード（まだ反応しやすいです）<br>
　　ツイッター（時間かかる可能性が高いです）のＤＭ<br>
　でお願いします。<br>
<br>
　マクロス、食品（特にカレー）、可愛い物、子供用の案件などは特に喜びます。<br>
　Ｖｔｕｂｅｒ用のＥメールがないため申し訳ありません。<br>
<br>
　ないとは思いますが、お仕事は現在募集しておりません。<br>
　Ｖｔｕｂｅｒと学業が忙しくとてもそれ以外に何かをする余裕がないからです。<br>
<br>
　それでもどうしてもお仕事を依頼したいという事であれば、私が余裕のある時に<br>
　お願いします。<br>
<br>
<h3>★案件履歴</h3>`,
    en: '',
    zh: '',
    ko: '',
    fr: '',
    de: '',
    it: '',
    es: '',
    pt: '',
    pl: '',
    tr: '',
    ru: '',
    uk: ''
  }
]