const n_id = 5;

const n_data = [
    {
      id: 1,
      day: '2024/10/09',
      titl: {
        ja: 'フィアちゃんのお誕生日です',
        en: 'It is the birthday of Fia',
        zh: '这是菲亚的生日',
        ko: '휘아의 생일입니다',
        fr: 'Ce est le jour de naissance de Fia',
        de: 'Es ist Fias Geburtstag',
        it: 'È il compleanno di Fia',
        es: 'es el cumpleaños de Fia',
        pt: 'é o aniversário de Fia',
        pl: 'to urodziny Fia',
        tr: 'Fianın doğum günü',
        ru: 'Это день рождения Fia',
        uk: 'це день народження Fia'
      },
      m_text: {
        ja: `今日はフィアちゃんのお誕生日です🥰
また大きくなりました😑

大人になった時に理想の大きさがあったのにこの時点で超えちゃったんですけど😨
もう調節できるのは体重しかないのね😭

まあそんな事よりも今年は何とリアルの学校のお友達もお誕生日を祝ってくれるのです🥰
毎年どす黒い誕生パーティーしかしなかった去年に比べたらかなりいいね😑
まあでも可愛いドレスが着れる、そこだけはすっごくいいんだけどね🥰

だからすっごく楽しみです🥰
だけどゲームでボコボコにされる未来が見える・・・・😭
なんでみんなアクションゲーム好きなのよ😨

シュミレーションゲーム面白いよ？（力説
それとフィアちゃんは毎日いろいろ忙しいけど一緒に遊ぶのを誘ってくれると嬉しいな（チラッ`,
        en: 'English Content ',
        zh: '',
        ko: '',
        fr: '',
        de: '',
        it: '',
        es: '',
        pt: '',
        pl: '',
        tr: '',
        ru: '',
        uk: ''
      }
    },
    {
      id: 2,
      day: '2024/10/19',
      titl: {
        ja: 'フィアちゃんイギリスへ',
        en: 'English Title2',
        zh: '',
        ko: '',
        fr: '',
        de: '',
        it: '',
        es: '',
        pt: '',
        pl: '',
        tr: '',
        ru: '',
        uk: ''
      },
      m_text: {
        ja: `フィアちゃん今年もパパとママのお仕事の関係でイギリスに行く事になりました
これに伴いフィアちゃんは活動時間がだいぶ異なります

具体的にはサマータイム時に８時間、それ以外は９時間です
例をあげるなら日本時間で１５時なら、イギリスではサマータイム時、朝の７時って感じだね😊

制作する時間とかはそこまで変わらない物の配信とかを見に行ける時間が異なるからフィアちゃんが来なくなったからって泣かないでね？😭
逆に今まで行けなかった人の配信に行けるチャンスかも
だから来てほしい人はアピールしちゃおう🥰

なおフィアちゃん今年からイギリスで女子校に転校します😑
変な虫がつかないようにするためなんですね
わかります😑

去年失敗したカボチャ作り頑張ろ🎵
その前に毎年引いてる風邪を何とかしないとね😨`,
        en: 'English Content2',
        zh: '',
        ko: '',
        fr: '',
        de: '',
        it: '',
        es: '',
        pt: '',
        pl: '',
        tr: '',
        ru: '',
        uk: ''
      }
    },
    {
      id: 3,
      day: '2024/11/01',
      titl: {
        ja: '方針の変更',
        en: 'English Title2',
        zh: '',
        ko: '',
        fr: '',
        de: '',
        it: '',
        es: '',
        pt: '',
        pl: '',
        tr: '',
        ru: '',
        uk: ''
      },
      m_text: {
        ja: `方針の変更です😑
今までは配信を早めようとエンディングを作るのを重点的に進めていたけど、ちょっと変更です😑

ボイスロイドをもらったり、いろいろ動画技術も上がったり、エフェクトもあれこれ作って増えてきたから動画を作るのを重点的に進める事にしました🥰

まあ、それに大人の事情も色々からんでるしね😑
相変わらずフィアちゃんは色々運が左右するな～と思わなくもない🤔
この世の中は実力か運かの論争がとある界隈であったけど、運が高い人ほど成功するっという理論的結論が出たのよね😑
その理論痛いほどわかるわ😨

まあでも今回はいつものように悪くなったってわけじゃないからそこは安心😊
実はフィアちゃん自体もエンディング作ってはいるけどフィアちゃんでは扱えない技術を依頼しているの😌
その人はフィアちゃんの方針にかなり近い人に担当をお願いしてるから完成が割と楽しみではあったりする🥰
いつものように進行不能な事態になっているのではなく（別の件で進行不能に陥ってはいるけど）割と希望に満ちた方針変更なんだからね🥰

というわけでボイスロイドの使い方を覚えたらライブ２Ｄの使い方を覚えねば（グッ
そんなわけで、いつもの運の悪さが発生しなければ１～３月には動画を大量生産できる体制が整うはず・・・・😌
そうなったらようやくまともに活動しているように見せれるね😭

フィアちゃん何もしてないわけじゃないんです～😭
見えないところでいろいろやってるんです～😭`,
        en: 'English Content2',
        zh: '',
        ko: '',
        fr: '',
        de: '',
        it: '',
        es: '',
        pt: '',
        pl: '',
        tr: '',
        ru: '',
        uk: ''
      }
    },
    {
      id: 4,
      day: '2024/12/01',
      titl: {
        ja: 'フィアちゃんホームページ製作開始',
        en: 'English Title2',
        zh: '',
        ko: '',
        fr: '',
        de: '',
        it: '',
        es: '',
        pt: '',
        pl: '',
        tr: '',
        ru: '',
        uk: ''
      },
      m_text: {
        ja: `レッツホームページ制作です😊
え、フィアちゃん動画作るのを優先するんじゃんじゃなかったの？
と思う人はいるかもしれないけど😑

実は動画・ホームページ・配信をする上で実はＪａｖａＳｃｒｉｐｔがあっちこっちで使うことが分かってきたのよ🤔
相変わらず何かやろうとしたら別の何かが立ちはだかるね😑

そのためライブ２Ｄも習得しつつ、ＪａｖａＳｃｒｉｐｔを習得するため、なんか他の事で忙しくてしばらく放置していたホームページを作る事にしました😝

ホームページは割とジャバスクリプト使うし練習にもってこいだったからね😊
それにいつかつくろうと思っていたからね😊

昔はフィアちゃんはＨＴＭＬとＣＳＳだけの技術で作ってたけど、今は動画をつかったり、ジャバスクリプトもこれから導入することを考えたら相当いいのができそう🥰

ちなみにパパの会社の昔のホームページはフィアちゃんが作ってたんだべ（ボソッ
今のホームページは会社の人が作ったの使ってるけど・・・・😑
フィアちゃんがずっと担当でいいと思うの😭
パパの会社に帰りたい😭`,
        en: 'English Content2',
        zh: '',
        ko: '',
        fr: '',
        de: '',
        it: '',
        es: '',
        pt: '',
        pl: '',
        tr: '',
        ru: '',
        uk: ''
      }
    },
    {
      id: 5,
      day: '2024/12/24',
      titl: {
        ja: 'クリスマスだよ💖',
        en: 'English Title2',
        zh: '',
        ko: '',
        fr: '',
        de: '',
        it: '',
        es: '',
        pt: '',
        pl: '',
        tr: '',
        ru: '',
        uk: ''
      },
      m_text: {
        ja: `クリスマスの日です😊　メリークリスマス💖
日本では大人は恋人や夫婦ですごすと言われているあのクリスマスです😊

だけどフィアちゃんには関係ありません😑
イギリスの場合は家族ですごすのが普通なんです😊

その熱狂ぶりはすさまじく、お店は閉店、通行量がそれなりにある車も全く通りません😝
家族以外は陸の孤島に閉じ込められます😑

別段家族と過ごすのが嫌いなわけではないのです😊
普段は忙しいパパもママもこの時期にはお家に帰ってくるのでむしろその点は非常に嬉しいです🥰
たぶん会社とかから締め出されるんですね😑
わかります😑

だけどね

ある程度長いとやっぱり苦痛に思う日も来るわけですよ、ええ😭
微妙にＰＣの使用を控えさせられたりもするからたまに暇な時間がやってくる😨

フィアちゃんはＰＣを使って何かやりたいこと沢山あるねん😣
毎年そんな時はソワソワなのよね😣

そういえば今年はすっごくほしいゲームが販売されました
Elinという知る人ぞ知るあの名作Elonaの続編のゲームです🥰

作者のNeoさんもいろいろ苦労しているようで作った時の想いはいかほどなんだろうっと思いをはせるばかりです😑

まあだけどフィアちゃんのお小遣い、いろんな人に使ったから全くなくて買えなさそう・・・・😣
なんかフィアちゃんのお小遣いってほとんどだれかとの交際費に使ってる気がする😑

お小遣いもひっ迫してればＶ費用も毎回ひっ迫してるからフィアちゃんの将来はお金遣い荒くなる気がする・・・・😑
自分の事ながら心配だね😮`,
        en: 'English Content2',
        zh: '',
        ko: '',
        fr: '',
        de: '',
        it: '',
        es: '',
        pt: '',
        pl: '',
        tr: '',
        ru: '',
        uk: ''
      }
    },
    {
      id: 6,
      day: '2025/01/01',
      titl: {
        ja: '新年あけましておめでとうございます',
        en: 'English Title2',
        zh: '',
        ko: '',
        fr: '',
        de: '',
        it: '',
        es: '',
        pt: '',
        pl: '',
        tr: '',
        ru: '',
        uk: ''
      },
      m_text: {
        ja: '日本語本文2',
        en: 'English Content2',
        zh: '',
        ko: '',
        fr: '',
        de: '',
        it: '',
        es: '',
        pt: '',
        pl: '',
        tr: '',
        ru: '',
        uk: ''
      }
    },
    {
      id: 2,
      day: '2024/11/20',
      titl: {
        ja: '日本語タイトル2',
        en: 'English Title2',
        zh: '',
        ko: '',
        fr: '',
        de: '',
        it: '',
        es: '',
        pt: '',
        pl: '',
        tr: '',
        ru: '',
        uk: ''
      },
      m_text: {
        ja: '日本語本文2',
        en: 'English Content2',
        zh: '',
        ko: '',
        fr: '',
        de: '',
        it: '',
        es: '',
        pt: '',
        pl: '',
        tr: '',
        ru: '',
        uk: ''
      }
    }
  ];
  